Revit 2027 API
Categories.GetEnumerator Method
Retrieves a forward moving iterator to the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override IEnumerator GetEnumerator()
Public Overrides Function GetEnumerator As IEnumerator
public:
virtual IEnumerator^ GetEnumerator() override
abstract GetEnumerator : unit -> IEnumerator
override GetEnumerator : unit -> IEnumerator
Return Value
IEnumerator
A forward moving iterator to the map.
Implements
IEnumerable.GetEnumerator()
See Also
Reference
Categories Class
Autodesk.Revit.DB Namespace